# IsInUse Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DistributionSysType..::..IsInUse Property
DistributionSysType Class See Also
---
Get the value which indicates whether this distribution system is in service now.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsInUse { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsInUse As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsInUse {
	bool get ();
}
```

# See Also
DistributionSysType Class
Autodesk.Revit.DB.Electrical Namespace